app/Http/Controllers/Admin/InvoiceController.php

select * from `products` where `status` = 0 order by `name` asc
select * from `companies` where `status` = 0 order by `name` asc
select * from `payment_types` where `status` = 0
---
    public function index()
    {

        $products = Product::where('status',0)->orderBy('name')->get();
        $companies = Company::where('status',0)->orderBy('name')->get();
        $payment_types = PaymentType::where('status',0)->get();

select * from `invoices` where `status` = 0 and date(`created_at`) = '2021-07-04'
---
    public function get_todayinvoices(Request $request)
    {
      if($request->search)
      {
         $sales = Invoice::with('items','payments')->where([['status','0'],['invoice_no',$request->search]])
         ->get();

        if(count($sales)==0)
        {
          $sales = Invoice::with('items','payments')->where([['status','0'],['mobile',$request->search]])->orderBy('invoice_no','desc')->get();

        }
        return  $sales;
      }

        $sales =  Invoice::with('items')->where('status',0)->whereDate('created_at',date('Y-m-d'))->get();